src/cf/InformationRegisters/УменьшениеНалогаПСНнаСтраховыеВзносы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УменьшениеНалогаПСНнаСтраховыеВзносы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Патент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Патенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уведомление</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиКалендаряПодготовкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/УведомлениеОСпецрежимахНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УведомлениеОСпецрежимахНалогообложения</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУведомленийОСпецрежимахНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеУведомления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантПризнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантФамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/УменьшениеНалогаПСНнаСтраховыеВзносы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные об уменьшениях налога по патентной системе налогооблоожения на суммы
// страховых взносов и больничных пособий
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой осуществляется отбор данных
//  Дата - Дата - определяет год, за который будут получены данные
//  Патент - СправочникСсылка.Патенты - если заполнен, то данные будут получены с отбором по патенту
//
// Возвращаемое значение:
//  Соответствие - * Ключ - СправочникСсылка.Патенты
//                 * Значение - Структура - см. НовыеСведенияУменьшениеНалогаПоПатенту
//
Функция СведенияУменьшениеНалогаЗаГод(Организация, Дата, Патент = Неопределено) Экспорт
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
		"ВЫБРАТЬ
		|	УменьшениеНалоговПСН.Патент КАК Патент,
		|	УменьшениеНалоговПСН.Уведомление КАК Уведомление,
		|	УменьшениеНалоговПСН.Сумма КАК Сумма,
		|	УменьшениеНалоговПСН.Уведомление.ДатаПодписи КАК Дата
		|ИЗ
		|	РегистрСведений.УменьшениеНалогаПСНнаСтраховыеВзносы КАК УменьшениеНалоговПСН
		|ГДЕ
		|	УменьшениеНалоговПСН.Организация = &Организация
		|	И &ОтборПоПатенту
		|	И НЕ УменьшениеНалоговПСН.Уведомление.ПометкаУдаления
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	Патент");
	УсловияЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если ЗначениеЗаполнено(Патент) Тогда
		УсловияЗапроса.Установить(1, Новый ВыражениеСхемыЗапроса("УменьшениеНалоговПСН.Патент = &Патент"));
	Иначе
		УсловияЗапроса.Установить(1, Новый ВыражениеСхемыЗапроса("УменьшениеНалоговПСН.Патент.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания"));
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Патент", Патент);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецГода(Дата));
	
	ВыборкаПатент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СведенияУменьшениеНалогаОбщие = Новый Соответствие;
	
	Пока ВыборкаПатент.Следующий() Цикл
		СведенияУменьшениеНалогаПоПатенту = НовыеСведенияУменьшениеНалогаПоПатенту();
		СведенияУменьшениеНалогаПоПатенту.Сумма = ВыборкаПатент.Сумма;
		ВыборкаДетальная = ВыборкаПатент.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл
			РеквизитыУведомления = НовыеСведенияОбУведомлении();
			ЗаполнитьЗначенияСвойств(РеквизитыУведомления, ВыборкаДетальная);
			СведенияУменьшениеНалогаПоПатенту.Уведомления.Добавить(РеквизитыУведомления);
		КонецЦикла;
		СведенияУменьшениеНалогаОбщие.Вставить(ВыборкаПатент.Патент, СведенияУменьшениеНалогаПоПатенту);
	КонецЦикла;
	
	Возврат СведенияУменьшениеНалогаОбщие;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыеСведенияУменьшениеНалогаПоПатенту()
	
	Сведения = Новый Структура;
	Сведения.Вставить("Сумма", 0);
	Сведения.Вставить("Уведомления", Новый Массив);
	Возврат Сведения;
	
КонецФункции

Функция НовыеСведенияОбУведомлении()
	
	Сведения = Новый Структура;
	
	Сведения.Вставить("Уведомление", Документы.УведомлениеОСпецрежимахНалогообложения.ПустаяСсылка());
	Сведения.Вставить("Сумма", 0);
	Сведения.Вставить("Дата", Дата(1, 1, 1));
	
	Возврат Сведения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
